from collections import Counter
s='流感每年都來，2009年爆發新流感疫情，造成1312人重症、50人死亡；2015至2016年的流感季，重症患者達2018人，425人死亡，各大醫院一床難求。衛福部疾管署提醒，流感與一般感冒不同，嚴重時有致命危險，接種疫苗是最有效的預防方法。'
t='今年度的公費流感疫苗將於十月一日開打，將提供600萬劑疫苗給符合條件者接種。流感疫苗雖然每年打，但每年民眾的疑問都不太一樣，以下整理今年民眾常見的10大流感疫苗接種問題，一次解答。'
print("1. ",len(s))#第一題(1. s共有幾個字(包含標點符號)?)
print("2. ",set(s))#第二題(2. s共有幾個不同的字(包含標點符號)?)
list_s=list(s)
n=""
a=n.join(list_s)
print("3. ",a)#第三題(3. 若list_s=list(s)，那麼如何從list_s兜成字串?)
print("4. ",set(s)&set(t))#4. 有哪些字在s與t都出現過(包含標點符號)?
print("5. ",set(s)^set(t))#5. s與t共有多少不同的字(包含標點符號)?
print("6. ",set(s)-set(t))#6. 有多少字只出現在s沒出現在t(包含標點符號)?
c=Counter(s)
print("7. s最常出現的字是:",c.most_common(1)[0][0])
c=Counter(t)
print("   t最常出現的字是:",c.most_common(1)[0][0])#7. 哪一個字在s與t出現次數最多(包含標點符號)?

"""
輸出
---------------------
1.  120
2.  {'感', '效', '苗', '死', '達', '3', '難', '署', '4', '床', '者', '冒', '5', '嚴', '命', '與', '衛', '。', '危', '般', '的', '9', '8', '2', '接', '是', '年', '流', '0', '季', '、', '疾', '最', '法', '種', '爆', '1', '至', '醫', '都', '患', '求', '大', '來', '不', '院', '，', '同', '有', '福', '重', '醒', '新', '亡', '部', '6', '預', '疫', '險', '方', '情', '人', '症', '發', '；', '每', '成', '提', '時', '致', '防', '各', '一', '管', '造'}
3.  流感每年都來，2009年爆發新流感疫情，造成1312人重症、50人死亡；2015至2016年的流感季，重症患者達2018人，425人死亡，各大醫院一床難求。衛福
部疾管署提醒，流感與一般感冒不同，嚴重時有致命危險，接種疫苗是最有效的預防方法。
4.  {'感', '苗', '者', '。', '的', '接', '年', '流', '0', '種', '1', '都', '大', '不', '，', '6', '疫', '每', '提', '一'}
5.  {'死', '雖', '命', '嚴', '與', '月', '般', '9', '開', '8', '疾', '爆', '民', '疑', '院', '給', '答', '供', '重', '醒', '預', '險', '人', '冒', '防', '劑', '但', '次', '度', '將', '2', '最', '、', '日', '患', '整', '部', '方', '情', '症', '；', '成', '時', '眾', '各', '效', 
'件', '3', '署', '床', '題', '公', '5', '危', '條', '合', '解', '至', '費', '來', '下', '同', '於', '福', '理', '今', '發', '然', '見', '萬
', '造', '太', '達', '打', '難', '以', '4', '衛', '是', '季', '法', '常', '醫', '十', '求', '有', '新', '亡', '問', '符', '樣', '致', '管'}
6.  {'效', '死', '達', '3', '難', '署', '4', '床', '命', '5', '嚴', '危', '與', '衛', '般', '9', '8', '2', '是', '季', '最', '、', '疾', ' 
法', '爆', '至', '醫', '患', '求', '來', '院', '同', '有', '福', '重', '醒', '管', '新', '亡', '部', '預', '險', '方', '情', '人', '症', ' 
發', '；', '成', '時', '致', '防', '各', '冒', '造'}
7. s最常出現的字是: ，
   t最常出現的字是: 年

"""
